#pragma once
#include <opencv2/core.hpp>

class XImagePro
{
public:
    // Конструктор класу XImagePro
    XImagePro();

    // Деструктор класу XImagePro
    ~XImagePro();

    // Встановлює два вхідних зображення
    // mat1 - перше вхідне зображення
    // mat2 - друге вхідне зображення
    void Set(cv::Mat mat1, cv::Mat mat2);

    // Повертає результуюче зображення
    // Повертає: результуюче зображення (cv::Mat)
    cv::Mat Get() { return des; }

    // Налаштовує яскравість та контрастність зображення
    // bright - яскравість
    // contrast - контрастність
    void Gain(double bright, double contrast);

    // Повертає зображення на 90 градусів за годинниковою стрілкою
    void Rotate90();

    // Повертає зображення на 180 градусів
    void Rotate180();

    // Повертає зображення на 270 градусів за годинниковою стрілкою
    void Rotate270();

    // Відображає зображення по горизонталі
    void FlipX();

    // Відображає зображення по вертикалі
    void FlipY();

    // Відображає зображення по горизонталі та вертикалі
    void FlipXY();

    // Змінює розмір зображення
    // width - нова ширина
    // height - нова висота
    void Resize(int width, int height);

    // Зменшує розмір зображення за допомогою пірамідального зменшення
    // count - кількість ітерацій
    void PyDown(int count);

    // Збільшує розмір зображення за допомогою пірамідального збільшення
    // count - кількість ітерацій
    void PyUp(int count);

    // Обрізає зображення
    // x - координата верхнього лівого кута по горизонталі
    // y - координата верхнього лівого кута по вертикалі
    // w - ширина області обрізки
    // h - висота області обрізки
    void Clip(int x, int y, int w, int h);

    // Перетворює зображення в градації сірого
    void Gray();

    // Наносить мітку на зображення
    // x - координата мітки по горизонталі
    // y - координата мітки по вертикалі
    // a - параметр, який визначає інтенсивність або розмір мітки
    void Mark(int x, int y, double a);

    // Змішує два зображення
    // a - параметр, який визначає рівень змішування
    void Blend(double a);

    // Об'єднує два зображення в одне
    void Merge();

private:
    cv::Mat src1, src2; // Вхідні зображення
    cv::Mat des; // Результуюче зображення
};